//
// This file contains an 'Intel Peripheral Driver' and is      
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may 
// be modified by the user, subject to additional terms of the 
// license agreement                                           
//
// *++
//
// Copyright (c) 1999 - 2015 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//

//	
// Module Name:
//
//   ThermalConfigStr.uni
// 
// Abstract:
// 
//   String definitions for Thermal Configuration form.
// 
// Revision History:
// 
// --*/

/=#

#langdef   en-US "English"


#string STR_THERMAL_CONFIGURATION                   #language en-US "CPU Thermal Configuration"
#string STR_THERMAL_CONFIGURATION_HELP	            #language en-US "CPU Thermal Configuration Parameters"

#string STR_DFX_THERMAL_CONFIGURATION                   #language en-US "CPU DFX Thermal Configuration"
#string STR_DFX_THERMAL_CONFIGURATION_HELP	            #language en-US "CPU DFX Thermal Configuration Parameters"

#string STR_ENABLED                                 #language en-US  "Enabled"
#string STR_DISABLED                                #language en-US  "Disabled"

#string STR_POSITIVE_SIGN                           #language en-US  "Positive"
#string STR_NEGATIVE_SIGN                           #language en-US  "Negative"

#string STR_TJ_TARGET                               #language en-US  "TJ Target"
#string STR_TJ_TARGET_HELP                          #language en-US  "Offset below TJMAX to set as the PROCHOT# activation temperature. Valid range 0C to 63C."
#string STR_TCONTROL_OFSSET                         #language en-US  "Tcontrol Offset"
#string STR_TCONTROL_OFSSET_HELP                    #language en-US  "Offset to modify Tcontrol for DTS2.0. Valid range 0C to 63C."
#string STR_TCONTROL_OFSSET_SIGN                    #language en-US  "Tcontrol Offset Sign"
#string STR_TCONTROL_OFSSET_SIGN_HELP               #language en-US  "To select the the sign for the Tcontrol Offset value"
#string STR_100_PERCENT                             #language en-US  "100% clkon"
#string STR_87_5_PERCENT                            #language en-US  "87.5% clkon"
#string STR_75_PERCENT                              #language en-US  "75.0% clkon"
#string STR_62_5_PERCENT                            #language en-US  "62.5% clkon"
#string STR_50_PERCENT                              #language en-US  "50.0% clkon"
#string STR_37_5_PERCENT                            #language en-US  "37.5% clkon"
#string STR_25_PERCENT                              #language en-US  "25.0% clkon"
#string STR_12_5_PERCENT                            #language en-US  "12.5% clkon"
#string STR_OUTOFSPEC_THRESH                        #language en-US  "Out of Spec Threshold"
#string STR_OUTOFSPEC_THRESH_HELP                   #language en-US  "Degrees over TJMAX the temperature can reach before BIOS must execute a graceful shutdown. Range is 0C - 63C"
#string STR_OUTOFSPEC_INTERRUPT_PROMPT              #language en-US  "Out of Spec Interrupt"
#string STR_OUTOFSPEC_INTERRUPT_PROMPT_HELP         #language en-US  "Enables generation of a thermal interrupt whenever Out of Spec temperature threshold is crossed."
#string STR_LOW_TEMP_INTERRUPT_PROMPT               #language en-US  "Low Temp Interrupt"
#string STR_LOW_TEMP_INTERRUPT_PROMPT_HELP          #language en-US  "Trigger an interrupt when the temperature goes from HOT to NOT_HOT."
#string STR_HIGH_TEMP_INTERRUPT_PROMPT              #language en-US  "High Temp Interrupt"
#string STR_HIGH_TEMP_INTERRUPT_PROMPT_HELP         #language en-US  "Triggers an interrupt when the temperature goes from NOT_HOT to HOT."
#string STR_THRESHOLD1                              #language en-US  "Threshold 1 Rel Temp"
#string STR_THRESHOLD1_HELP                         #language en-US  "Degrees below TJMAX to signal an interrupt whenever the temperature crosses this threshold. Range is 0C - 127C"
#string STR_THRESHOLD2                              #language en-US  "Threshold 2 Rel Temp"
#string STR_THRESHOLD2_HELP                         #language en-US  "Degrees below TJMAX to signal an interrupt whenever the temperature crosses this threshold. Range is 0C - 127C"
#string STR_THRESHOLD1_INTERRUPT_PROMPT             #language en-US  "Threshold 1 Interrupt"
#string STR_THRESHOLD1_INTERRUPT_PROMPT_HELP        #language en-US  "Enables generation of a thermal interrupt whenever Threshold 1 is crossed."
#string STR_THRESHOLD2_INTERRUPT_PROMPT             #language en-US  "Threshold 2 Interrupt"
#string STR_THRESHOLD2_INTERRUPT_PROMPT_HELP        #language en-US  "Enables generation of a thermal interrupt whenever Threshold 2 is crossed."
#string STR_PROCHOT_INT_EN                          #language en-US  "External PROCHOT Interrupt"
#string STR_PROCHOT_INT_EN_HELP                     #language en-US  "Enables generation of an interrupt when an external device drives the PROCHOT# pin."
#string STR_PROCHOT_RESPONSE                        #language en-US "PROCHOT RESPONSE"
#string STR_PROCHOT_RESPONSE_HELP                   #language en-US "Prochot Configurable Response Enable. INTERNAL INTEL ONLY:Ucode will copy this value to/from PCU_CR_FIRM_CONFIG(12)."
#string STR_PROCHOT_OUTPUT_MODE_DISABLE             #language en-US "Prochot Output Mode Disable"
#string STR_PROCHOT_OUTPUT_MODE_DISABLE_HELP        #language en-US "Prochot output disable. INTERNAL INTEL ONLY:Prochot output disable. Ucode will copy this value to/from PCU_CR_FIRM_CONFIG(11)."
#string STR_PROCHOT_FREQUENCY_RESPONSE              #language en-US "Prochot Frequency Response"
#string STR_PROCHOT_FREQUENCY_RESPONSE_HELP         #language en-US "Control the level of PROCHOT throttling."
#string STR_VR_THERMAL_ALERT_DISABLE                #language en-US "VR_THERM_ALERT_DISABLE"
#string STR_VR_THERMAL_ALERT_DISABLE_HELP           #language en-US "When set to 1, disables the VR_THERMAL_ALERT signaling. INTERNAL INTEL ONLY:Disable SVID during bclk overclocking mode. This bit is a mirror of PCU_CR_FIRM_CONFIG(14)."
#string STR_LOCK_THERM_INT                          #language en-US "LOCK_THERM_INT"
#string STR_LOCK_THERM_INT_HELP                     #language en-US " Ties thermal interrupts from both cores. If set then thermal interrupt on one core is routed to all cores."

#string STR_TM2                                     #language en-US  "TM2 Status"
#string STR_TM2_HELP                                #language en-US  "TM1 and GV3 must be enabled in order to support TM2"
#string STR_100_PERCENT                             #language en-US  "100% clkon"
#string STR_87_5_PERCENT                            #language en-US  "87.5% clkon"
#string STR_75_PERCENT                              #language en-US  "75.0% clkon"
#string STR_62_5_PERCENT                            #language en-US  "62.5% clkon"
#string STR_50_PERCENT                              #language en-US  "50.0% clkon"
#string STR_37_5_PERCENT                            #language en-US  "37.5% clkon"
#string STR_25_PERCENT                              #language en-US  "25.0% clkon"
#string STR_12_5_PERCENT                            #language en-US  "12.5% clkon"

#string STR_ACPI_CRITICAL_THERMAL_TRIP_POINT        #language en-US  "Critical Trip Point"
#string STR_ACPI_CRITICAL_THERMAL_TRIP_POINT_HELP   #language en-US  "This value controls the temperature of the ACPI Critical Trip Point - the point in which the OS will shut the system off.\n\nNOTE:  100C is the Plan Of Record (POR) for all Intel mobile processors."
#string STR_30_C                                    #language en-US  "30 C"
#string STR_40_C                                    #language en-US  "40 C"
#string STR_50_C                                    #language en-US  "50 C"
#string STR_60_C                                    #language en-US  "60 C"
#string STR_70_C                                    #language en-US  "70 C"
#string STR_80_C                                    #language en-US  "80 C"
#string STR_90_C                                    #language en-US  "90 C"
#string STR_95_C                                    #language en-US  "95 C"
#string STR_100_C                                   #language en-US  "100 C"
#string STR_87_C                                    #language en-US  "87 C"
#string STR_95_C                                    #language en-US  "95 C"
#string STR_103_C                                   #language en-US  "103 C"
#string STR_111_C                                   #language en-US  "111 C"
#string STR_119_C                                   #language en-US  "119 C"
#string STR_POR                                     #language en-US  "POR"
#string STR_0LEN                                    #language en-US  ""

//
// End of file
//